app/views/posts/show.html.erb

      </div>
      <% if Like.find_by(user_id: @current_user.id, post_id: @post.id) %>
---
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 11], ["post_id", 12], ["LIMIT", 1]]