app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password") VALUES (?, ?, ?, ?, ?)  [["name", "a"], ["email", "a"], ["created_at", "2019-02-12 04:13:19.446783"], ["updated_at", "2019-02-12 04:13:19.446783"], ["password", "a"]]
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password]
    )
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 11]]
---
  def likes
    # 変数@userを定義してください
    @user = User.find_by(id: params[:id])

    # 変数@likesを定義してください
    @likes = Like.where(user_id: @user.id)